Devraux/STM32F746-oscilloscope/display_lib/display.h
#ifndef _DISPLAY_LIB_
#define _DISPLAY_LIB_


//*** This library is part of oscilloscope application based on stm32f746 embedded in STM32 Discovery board ***//
//*** These functions implement graphical features necessary to basic oscilloscope features ***//
//*** This library is dedicated to 272px x 480px display ***//

//*** Display Layout***//
/// _____________________________
///|          Top Bar            |
///|-----------------------------|
///|                     |       |
///|         Chart       |Buttons|
///|                     |       |
///|-----------------------------|
///|          Bottom Bar         |
///|_____________________________|


#include "main.h"
#include "lvgl.h"
#include "core_cm7.h"
#include "lvgl.h"
#include "ui.h"
#include "../STM32F746_Hardware_Lib/stm32746g_discovery_sdram.h"
#include "../Core/Inc/adc.h"
#include "../Inc/ltdc.h"

#define RESOLUTION_HORIZONTAL 480
#define RESOLUTION_VERTICAL 272
#define BYTES_PER_PIXEL (LV_COLOR_FORMAT_GET_SIZE(LV_COLOR_FORMAT_RGB565))

#define DISPLAY_BUTTONS_WIDTH 	76
#define DISPLAY_BUTTONS_HEIGHT 	48
#define DISPLAY_CHART_WIDTH 	404
#define DISPLAY_CHART_HEIGHT 	248

void lv_example_get_started_2(void);

/// display initialization
void display_init(void);

/// my flush call back
void my_flush_cb(lv_display_t *display, const lv_area_t *area, uint8_t *px_map);

///  Widget description: Plot current and past input signal sample's measured by ADC3.
///
///  Displayed features:
/// 					- Chart
///			  			- Grid
void display_chartWindow(void);


///  Widget description: right side buttons which allows to choose oscilloscope options
///
///  Displayed features:
/// 					- "Stop/Run"                Button
///						- "Place X/Y Cursor 1 | 2"  button
/// 					- "DC/AC Coupling"          button
/// 					- "Math functions"          button
///						- "More options"            button
void display_buttonsWindow(void);


///  Widget description: bottom bar measure
///
///  Displayed features:
/// 					- "VOLTS/DIV"                 label
///						- "TIME/DIV"                  label
/// 					- "X_Coordinate Cursor_1 | 2" label
/// 					- "Y_Coordinate Cursor_1 | 2" label
void display_bottomBarWindow(void);


///  Widget description: top bar additional informations
///
///  Displayed features:
/// 					- Time     label
///						- "Status" label
///	Due to small screen size topBarWindow is not used. Some data from Top bar were moved to bottom bar
///void display_topBarWindow(void);


void update_chart(lv_timer_t *timer);
void display_setAxis(void);

#endif
